<?php

use Illuminate\Database\Seeder;

class FacultiesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [   //1
                'name' => 'ФОТІУС',
                'description' => 'Факультет обчилювальної техніки, інтелектуальних та управляючих систем',
                'avatar_id' => null,
            ],
            [   //2
                'name' => 'ННІ економіки і права',
                'description' => 'Lorem Ipsum - це текст-"риба", що використовується в друкарстві та дизайні. Lorem Ipsum є, фактично, стандартною "рибою" аж з XVI сторіччя, коли невідомий друкар',
                'avatar_id' => null,
            ],
            [   //3
                'name' => 'ННІ іноземних мов',
                'description' => 'На відміну від поширеної думки Lorem Ipsum не є випадковим набором літер. Він походить з уривку класичної латинської літератури 45 року до н.е., тобто має більш як 2000-річну історію. Річард Макклінток, професор латини з коледжу Хемпдін-Сидні, що у Вірджінії, вивчав одне з найменш зрозумілих латинських слів - consectetur - з уривку Lorem Ipsum, ',
                'avatar_id' => null,
            ],
            [   //4
                'name' => 'ННІ історії і філософії',
                'description' => 'ННІ історії і філософії',
                'avatar_id' => null,
            ],
            [   //5
                'name' => 'ННІ педагогічної освіти, соціальної роботи і мистецтва',
                'description' => 'ННІ педагогічної освіти, соціальної роботи і мистецтва',
                'avatar_id' => null,
            ],
            [   //6
                'name'  =>  'ННІ природничих наук',
                'description'   =>  'Lorem Ipsum. Він використовує словник з більш як 200 слів латини та цілий набір моделей речень - це дозволяє генерувати Lorem Ipsum, який виглядає осмислено. ',
                'avatar_id' => null,
            ],
            [   //7
                'name'  =>  'ННІ української філології та соціальних комунікацій',
                'description' =>  'Таким чином, згенерований Lorem Ipsum не міститиме повторів, жартів, нехарактерних для латини слів і т.ін.',
                'avatar_id' => null,
            ],
            [   //8
                'name'  =>  'ННІ фізики, математики та комп’ютерно-інформаційних систем',
                'description' =>  'Різні версії Lorem Ipsum з’явились за минулі роки, деякі випадково, деякі було створено зумисно (зокрема, жартівливі).',
                'avatar_id' => null,
            ],
            [    //9
                'name'  =>  'ННІ фізичної культури, спорту і здоров’я',
                'description' =>  '"Риба" не тільки успішно пережила п’ять століть, але й прижилася в електронному верстуванні, залишаючись по суті незмінною.',
                'avatar_id' => null,
            ],
            [   //10
                'name'  =>  'Психологічний факультет',
                'description' =>  'які містили уривки з Lorem Ipsum, і вдруге - нещодавно завдяки програмам комп’ютерного верстування на кшталт Aldus Pagemaker, які використовували різні версії Lorem Ipsum.',
                'avatar_id' => null,
            ],
            [   //11
                'name'  =>  'Інститут доуніверситетської підготовки і післядипломної освіти',
                'description' =>  'Класичний текст, використовуваний з XVI сторіччя, наведено нижче для всіх зацікавлених. Також точно за оригіналом наведено розділи 1.10.32 та 1.10.33 цицеронівського "de Finibus Bonorum et Malorum" разом із перекладом англійською, виконаним 1914 року Х.Рекемом.',
                'avatar_id' => null,
            ]
        ];

        foreach ($data as $element) {
            \App\Faculty::create($element);
        }
    }
}
